/* GStreamer ACM AAC Encoder plugin
 * Copyright (C) 2013 Atmark Techno, Inc.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Library General Public
 * License as published by the Free Software Foundation; either
 * version 2 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Library General Public License for more details.
 *
 * You should have received a copy of the GNU Library General Public
 * License along with this library; if not, write to the
 * Free Software Foundation, Inc., 59 Temple Place - Suite 330,
 * Boston, MA 02111-1307, USA.
 */

/**
 * SECTION:element-acmaacenc
 *
 * acmaacenc encodes raw audio to AAC (MPEG-4 part 3) streams.
 *
 * <refsect2>
 * <title>Example launch line</title>
 * |[
 * gst-launch audiotestsrc wave=sine num-buffers=100 ! audioconvert ! acmaacenc ! matroskamux ! filesink location=sine.mkv
 * ]| Encode a sine beep as aac and write to matroska container.
 * |[
 * gst-launch filesrc location=abc.wav ! wavparse ! audioresample ! audioconvert ! acmaacenc ! filesink location=abc.aac
 * ]|
 * </refsect2>
 */

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include <stdio.h>
#include <unistd.h>
#include <string.h>
#include <time.h>
#include <sys/time.h>
#include <gst/audio/audio.h>
#include <media/acm-aacenc.h>

#include "gstacmaacenc.h"
#include "v4l2_util.h"
#include "gstacm_util.h"
#include "gstacm_debug.h"


/* エンコーダv4l2デバイスのドライバ名 */
#define DRIVER_NAME						"acm-aacenc"

/* 出力フォーマット ADIF のサポート	*/
#define SUPPORT_OUTPUT_FMT_ADIF			0

/* バッファプール内のバッファを no copy で down stream に push する	*/
#define DO_PUSH_POOLS_BUF				0	/* do copy */

/* デバイスに確保するバッファ数
 * プレエンコードに 2 フレーム必要なため、バッファ数は 3 以上必要
 */
#define DEFAULT_NUM_BUFFERS_IN			3
#define DEFAULT_NUM_BUFFERS_OUT			3

/* エンコーダー初期化パラメータのデフォルト値	*/
#define DEFAULT_VIDEO_DEVICE			"/dev/video0"
#define DEFAULT_BITRATE					64000
#define DEFAULT_OUT_FORMAT				ACM_AAC_BS_FORMAT_ADTS
#define DEFAULT_ENABLE_CBR				GST_ACMAACENC_ENABLE_CBR_FALSE /* VBR */

/* select() の timeout 時間 */
#define SELECT_TIMEOUT_MSEC				1000

/* 1フレームのサンプル数	*/
#define SAMPLES_PER_FRAME				1024

/* プレエンコード回数（現状固定値）	*/
#define PRE_ENC_NUM						2

/* プレエンコード用に確保する入力データサイズ 
 * 1024 sample x 2ch x 16bit x 2 buf
 */
#define PRE_ENC_BUF_SIZE				(SAMPLES_PER_FRAME * 2 * 2 * PRE_ENC_NUM)

/* デバッグログ出力フラグ		*/
#define DBG_LOG_PERF_CHAIN				0
#define DBG_LOG_PERF_SELECT_IN			0
#define DBG_LOG_PERF_PUSH				0
#define DBG_LOG_PERF_SELECT_OUT			0
#define DBG_LOG_OUT_TIMESTAMP			0

/* select() による待ち時間の計測		*/
#define DBG_MEASURE_PERF_SELECT_IN		0
#define DBG_MEASURE_PERF_SELECT_OUT		0
#define DBG_MEASURE_PERF_HANDLE_FRAME	0
#define DBG_MEASURE_PERF_FINISH_FRAME	0

/* 入力・出力データのファイルへのダンプ	*/
#define DBG_DUMP_IN_BUF					0
#define DBG_DUMP_OUT_BUF				0


#if DBG_MEASURE_PERF_SELECT_IN
static double g_time_total_select_in = 0;
#endif
#if DBG_MEASURE_PERF_SELECT_OUT
static double g_time_total_select_out = 0;
#endif


/* private member	*/
struct _GstAcmAacEncPrivate
{
	/* HW エンコーダの初期化済みフラグ	*/
	gboolean is_inited_encoder;

	/* QBUF(V4L2_BUF_TYPE_VIDEO_OUTPUT) 用カウンタ	*/
	gint num_inbuf_acquired;

	/* V4L2_BUF_TYPE_VIDEO_OUTPUT 側に入力したフレーム数と、
	 * V4L2_BUF_TYPE_VIDEO_CAPTURE 側から取り出したフレーム数の差分
	 */
	gint in_out_frame_count;

	/* プレエンコード回数	*/
	gint pre_encode_num;

	/* 入力フレーム用カウンタ	*/
	gint in_frame_count;
	
	/* プレエンコー用バッファ	*/
	GstBuffer * pre_encode_buf;
	gint pre_encode_buf_offset;
};

GST_DEBUG_CATEGORY_STATIC (acmaacenc_debug);
#define GST_CAT_DEFAULT acmaacenc_debug

#define GST_ACMAACENC_GET_PRIVATE(obj)  \
	(G_TYPE_INSTANCE_GET_PRIVATE ((obj), GST_TYPE_ACMAACENC, \
		GstAcmAacEncPrivate))

/* property */
enum
{
	PROP_0,
	PROP_DEVICE,
	PROP_BITRATE,
	PROP_ENABLE_CBR,
};

/* pad template caps for source and sink pads.	*/
#define SAMPLE_RATES	" 8000, " \
						"11025, " \
						"12000, " \
						"16000, " \
						"22050, " \
						"24000, " \
						"32000, " \
						"44100, " \
						"48000 " 

static GstStaticPadTemplate sink_template = GST_STATIC_PAD_TEMPLATE ("sink",
    GST_PAD_SINK,
    GST_PAD_ALWAYS,
    GST_STATIC_CAPS (
		"audio/x-raw, "
		"format = (string) " GST_AUDIO_NE (S16) ", "
		"layout = (string) interleaved, "
		"rate = (int) {" SAMPLE_RATES "}, "
		"channels = (int) [ 1, 2 ] "
	)
);

static GstStaticPadTemplate src_template = GST_STATIC_PAD_TEMPLATE ("src",
    GST_PAD_SRC,
    GST_PAD_ALWAYS,
	GST_STATIC_CAPS (
		"audio/mpeg, "
		"mpegversion = (int) 4, "
		"channels = (int) [ 1, 2 ], "
		"rate = (int) {" SAMPLE_RATES "}, "
#if SUPPORT_OUTPUT_FMT_ADIF
		"stream-format = (string) { adts, raw, adif };"
#else
		"stream-format = (string) { adts, raw };"
#endif
		"audio/mpeg, "
		"mpegversion = (int) 2, "
		"channels = (int) [ 1, 2 ], "
		"rate = (int) {" SAMPLE_RATES "}, "
#if SUPPORT_OUTPUT_FMT_ADIF
		"stream-format = (string) { adts, raw, adif };"
#else
		"stream-format = (string) { adts, raw };"
#endif
	)
);

/* DecoderSpecificInfo (codec_data)	*/
static const int mpeg4audio_sample_rates[16] = {
    96000, 88200, 64000, 48000, 44100, 32000,
    24000, 22050, 16000, 12000, 11025, 8000, 7350,
};
static const unsigned char mpeg4audio_channels[16] = {
    0, 1, 2, 3, 4, 5, 6, 8,
};
#define MAX_DECODER_SPECIFIC_INFO_SIZE	7	/* LC + SBR + PS config */
#define AOT_AAC_LC 2	/* AudioObjectType : ISO/IEC 13818-7 : 2006 Low Complexity */
static gboolean
get_decoder_specific_info(GstAcmAacEnc * me,
	unsigned char *oData, unsigned long *ioLen)
{
    int i;
    int srate_idx = -1, ch_idx = -1;
    int window_size = 0;
	
	if (NULL == oData || NULL == ioLen
		|| *ioLen < MAX_DECODER_SPECIFIC_INFO_SIZE) {
		GST_ERROR_OBJECT (me, "invalid arg.");
		
		return FALSE;
	}

    for (i = 0; i < 16; i++) {
		if (mpeg4audio_sample_rates[i] == me->sample_rate) {
			srate_idx = i;
			break;
		}
    }
    for (i = 0; i < 16; i++) {
		if (mpeg4audio_channels[i] == me->channels) {
			ch_idx = i;
			break;
		}
    }

	if (srate_idx < 0) {
		GST_ERROR_OBJECT (me, "invalid sample rate : %d", me->sample_rate);
		return FALSE;
	}
	if (ch_idx < 0) {
		GST_ERROR_OBJECT (me, "invalid channels : %d", me->channels);
		return FALSE;
	}

	oData[0] = AOT_AAC_LC << 3 | srate_idx >> 1;
	oData[1] = srate_idx << 7 | ch_idx << 3 | window_size << 2;

	*ioLen = 2;
	return TRUE;
}

/*  ビットレートの推奨値 : R-MobileA1マルチメディアミドル 機能仕様書	*/
static gint
default_bit_rate (gint rate)
{
	if (46009 <= rate)
		return 70000;	// 48,000 Hz
	else if (37566 <= rate)
		return 64000;	// 44,100 Hz
	else if (27713 <= rate)
		return 64000;	// 32,000 Hz
	else if (23004 <= rate)
		return 48000;	// 24,000 Hz
	else if (18783 <= rate)
		return 44100;	// 22,050 Hz
	else if (13856 <= rate)
		return 51200;	// 16,000 Hz
	else if (11502 <= rate)
		return 38400;	// 12,000 Hz
	else if (9391 <= rate)
		return 35280;	// 11,025 Hz
	else
		return 25600;	// 8,000 Hz
}

/*  enum acm_aacenc_sampling_rate_idx : acm-aacenc	*/
static gint
pcm_sample_rate_idx (gint rate)
{
	if (92017 <= rate)
		return ACM_SAMPLING_RATE_96000;	// 96,000Hz
	else if (75132 <= rate)
		return ACM_SAMPLING_RATE_88200;	// 88,200 Hz
	else if (55426 <= rate)
		return ACM_SAMPLING_RATE_64000;	// 64,000 Hz
	else if (46009 <= rate)
		return ACM_SAMPLING_RATE_48000;	// 48,000 Hz
	else if (37566 <= rate)
		return ACM_SAMPLING_RATE_44100;	// 44,100 Hz
	else if (27713 <= rate)
		return ACM_SAMPLING_RATE_32000;	// 32,000 Hz
	else if (23004 <= rate)
		return ACM_SAMPLING_RATE_24000;	// 24,000 Hz
	else if (18783 <= rate)
		return ACM_SAMPLING_RATE_22050;	// 22,050 Hz
	else if (13856 <= rate)
		return ACM_SAMPLING_RATE_16000;	// 16,000 Hz
	else if (11502 <= rate)
		return ACM_SAMPLING_RATE_12000;	// 12,000 Hz
	else if (9391 <= rate)
		return ACM_SAMPLING_RATE_11025;	// 11,025 Hz
	else
		return ACM_SAMPLING_RATE_8000;	// 8,000 Hz
}

/*  チャンネル数とチャンネルモードの対応 : acm-aacenc	*/
static gint
pcm_channel_mode (gint ch)
{
	if (1 == ch)
		return ACM_AAC_CHANNEL_MODE_MONAURAL;
	else if (2 == ch)
		return ACM_AAC_CHANNEL_MODE_STEREO;
	else
		return -1;	// error
}

/* string for "stream-format" caps	*/
static char*
stream_format_str(gint format)
{
	char* str = NULL;

	switch (format) {
	case ACM_AAC_BS_FORMAT_ADTS:
		str = "adts";
		break;
	case ACM_AAC_BS_FORMAT_RAW:
		str = "raw";
		break;
#if SUPPORT_OUTPUT_FMT_ADIF
	case ACM_AAC_BS_FORMAT_ADIF:
		str = "adif";
		break;
#endif
	default:
		str = "unknown";
		break;
	}

	return str;
}

/* channel position */
#define ACMAAC_ENC_MAX_CHANNELS	6
static const GstAudioChannelPosition
	aac_channel_positions[][ACMAAC_ENC_MAX_CHANNELS] = {
	{	/* 1 ch: Mono */
		GST_AUDIO_CHANNEL_POSITION_MONO
	},
	{	/* 2 ch: front left + front right (front stereo) */
