/* GStreamer RTO AAC Decoder plugin
 * Copyright (C) 2013 Kazunari Ohtsuka <<user@hostname.org>>
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Library General Public
 * License as published by the Free Software Foundation; either
 * version 2 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Library General Public License for more details.
 *
 * You should have received a copy of the GNU Library General Public
 * License along with this library; if not, write to the
 * Free Software Foundation, Inc., 59 Temple Place - Suite 330,
 * Boston, MA 02111-1307, USA.
 */

/**
 * SECTION:element-rtoaacdec
 *
 * rtoaacdec decodes AAC (MPEG-4 part 3) stream.
 *
 * <refsect2>
 * <title>Example launch lines</title>
 * |[
 * gst-launch filesrc location=example.mp4 ! qtdemux ! rtoaacdec ! audioconvert ! audioresample ! autoaudiosink
 * ]| Play aac from mp4 file.
 * |[
 * gst-launch filesrc location=example.adts ! rtoaacdec ! audioconvert ! audioresample ! autoaudiosink
 * ]| Play standalone aac bitstream.
 * </refsect2>
 */

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include <stdio.h>
#include <unistd.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <sys/time.h>
#include <sched.h>
#include <gst/audio/audio.h>

#include "gstrtoaacdec.h"
#include "v4l2_util.h"


/* バッファプール内のバッファを no copy で down stream に push する	*/
#define DO_PUSH_POOLS_BUF			1

/* チャンネル数のプロパティ指定は意味ない	*/
#define ENABLE_CHANNEL_PROPERTY		0

/* ドライバ側にEOS通知を行う		*/
#define NOTIFY_EOS_TO_DRIVER		0

#if NOTIFY_EOS_TO_DRIVER
# define V4L2_CID_EOS				(V4L2_CID_PRIVATE_BASE + 0) /* notify EOS */
#endif

/* defined at acm-driver/include/acm-aacdec.h	*/
struct acm_aacdec_private_format {
	int bs_format;
	int pcm_format;
	uint32_t max_channel;
	bool down_mix;
	int down_mix_mode;
	int compliance;
	int sampling_rate_idx;
};

/* 確保するバッファ数	*/
#define DEFAULT_NUM_BUFFERS_IN			12
#define DEFAULT_NUM_BUFFERS_OUT			12

/* デコーダ初期化パラメータのデフォルト値	*/
#define DEFAULT_VIDEO_DEVICE		"/dev/video0"
#define DEFAULT_ALLOW_MIXDOWN		FALSE
#define DEFAULT_MIXDOWN_MODE		GST_RTOAACDEC_MIXDOWN_MODE_STEREO
#define DEFAULT_COMPLIANT_STANDARD	GST_RTOAACDEC_MIXDOWN_COMPLIANT_ISO
#define DEFAULT_PCM_FORMAT			GST_RTOAACDEC_PCM_FMT_INTERLEAVED
#define DEFAULT_MAX_CHANNEL			6

/* select() の timeout */
#define SELECT_TIMEOUT_MSEC			400

/* デバッグログ出力フラグ		*/
#define DBG_LOG_PERF_CHAIN			0
#define DBG_LOG_PERF_SELECT_IN		0
#define DBG_LOG_PERF_PUSH			0
#define DBG_LOG_PERF_SELECT_OUT		0


/* select() による待ち時間の計測		*/
#define DBG_MEASURE_PERF				0
#if DBG_MEASURE_PERF
# define DBG_MEASURE_PERF_SELECT_IN		0
# define DBG_MEASURE_PERF_SELECT_OUT	0
# define DBG_MEASURE_PERF_HANDLE_FRAME	0
# define DBG_MEASURE_PERF_FINISH_FRAME	0
#endif

#if DBG_MEASURE_PERF
static double
gettimeofday_sec()
{
	struct timeval t;
	
	gettimeofday(&t, NULL);
	return (double)t.tv_sec + (double)t.tv_usec * 1e-6;
}
#endif
#if DBG_MEASURE_PERF_SELECT_IN
static double g_time_total_select_in = 0;
#endif
#if DBG_MEASURE_PERF_SELECT_OUT
static double g_time_total_select_out = 0;
#endif


GST_DEBUG_CATEGORY_STATIC (rtoaacdec_debug);
#define GST_CAT_DEFAULT rtoaacdec_debug

/* property */
enum
{
	PROP_0,
	PROP_DEVICE,
	PROP_ALLOW_MIXDOWN,
	PROP_MIXDOWN_MODE,
	PROP_COMPLIANT_STANDARD,
	PROP_PCM_FORMAT,
#if ENABLE_CHANNEL_PROPERTY
	PROP_MAX_CHANNEL,
#endif
};

/* pad template caps for source and sink pads.	*/
static GstStaticPadTemplate sink_template = GST_STATIC_PAD_TEMPLATE ("sink",
    GST_PAD_SINK,
    GST_PAD_ALWAYS,
    GST_STATIC_CAPS ("audio/mpeg, "
		"mpegversion = (int) 2; "
        "audio/mpeg, "
		"mpegversion = (int) 4, stream-format = (string) { raw, adts }")
    );

/* 16-bit per channel (interleaved or non interleaved). */
static GstStaticPadTemplate src_template = GST_STATIC_PAD_TEMPLATE ("src",
    GST_PAD_SRC,
    GST_PAD_ALWAYS,
	GST_STATIC_CAPS ("audio/x-raw, "
		"format = (string) " GST_AUDIO_NE(S16) ", "
		"rate = (int) [ 8000, 96000 ], "
		"channels = (int) [ 1, 8 ]")
    );

static int AACSamplingFrequency[16] = {
	96000, 88200, 64000, 48000,
	44100, 32000, 24000, 22050,
	16000, 12000, 11025, 8000,
	0, 0, 0, 0
};

/* Copied from vorbis; the particular values used don't matter */
static GstAudioChannelPosition channelpositions[][6] = {
	{	/* Mono */
		GST_AUDIO_CHANNEL_POSITION_MONO},
	{	/* Stereo */
        GST_AUDIO_CHANNEL_POSITION_FRONT_LEFT,
		GST_AUDIO_CHANNEL_POSITION_FRONT_RIGHT},
	{	/* Stereo + Centre */
        GST_AUDIO_CHANNEL_POSITION_FRONT_LEFT,
        GST_AUDIO_CHANNEL_POSITION_FRONT_RIGHT,
		GST_AUDIO_CHANNEL_POSITION_FRONT_CENTER},
	{	/* Quadraphonic */
        GST_AUDIO_CHANNEL_POSITION_FRONT_LEFT,
        GST_AUDIO_CHANNEL_POSITION_FRONT_RIGHT,
        GST_AUDIO_CHANNEL_POSITION_REAR_LEFT,
        GST_AUDIO_CHANNEL_POSITION_REAR_RIGHT,
	},
	{	/* Stereo + Centre + rear stereo */
        GST_AUDIO_CHANNEL_POSITION_FRONT_LEFT,
        GST_AUDIO_CHANNEL_POSITION_FRONT_RIGHT,
        GST_AUDIO_CHANNEL_POSITION_FRONT_CENTER,
        GST_AUDIO_CHANNEL_POSITION_REAR_LEFT,
        GST_AUDIO_CHANNEL_POSITION_REAR_RIGHT,
	},
	{	/* Full 5.1 Surround */
        GST_AUDIO_CHANNEL_POSITION_FRONT_LEFT,
        GST_AUDIO_CHANNEL_POSITION_FRONT_RIGHT,
        GST_AUDIO_CHANNEL_POSITION_FRONT_CENTER,
        GST_AUDIO_CHANNEL_POSITION_LFE1,
        GST_AUDIO_CHANNEL_POSITION_REAR_LEFT,
        GST_AUDIO_CHANNEL_POSITION_REAR_RIGHT,
	}
};

/*  サンプリング周波数パラメータ : R-MobileA1マルチメディアミドル 機能仕様書 Ver.0.14	*/
static gint
aac_rate_idx (gint rate)
{
	if (92017 <= rate)
		return 0;	// 96,000Hz
	else if (75132 <= rate)
		return 1;	// 88,200 Hz
	else if (55426 <= rate)
		return 2;	// 64,000 Hz
	else if (46009 <= rate)
		return 3;	// 48,000 Hz
	else if (37566 <= rate)
		return 4;	// 44,100 Hz
	else if (27713 <= rate)
		return 5;	// 32,000 Hz
	else if (23004 <= rate)
		return 6;	// 24,000 Hz
	else if (18783 <= rate)
		return 7;	// 22,050 Hz
	else if (13856 <= rate)
		return 8;	// 16,000 Hz
	else if (11502 <= rate)
		return 9;	// 12,000 Hz
	else if (9391 <= rate)
		return 10;	// 11,025 Hz
	else
		return 11;	// 8,000 Hz
}

static gboolean gst_rto_aac_dec_open (GstAudioDecoder * dec);
static gboolean gst_rto_aac_dec_close (GstAudioDecoder * dec);
static gboolean gst_rto_aac_dec_start (GstAudioDecoder * dec);
static gboolean gst_rto_aac_dec_stop (GstAudioDecoder * dec);
static gboolean gst_rto_aac_dec_set_format (GstAudioDecoder * dec,
	GstCaps * caps);
static gboolean gst_rto_aac_dec_update_caps (GstRtoAacDec * me);
static gboolean gst_rto_aac_dec_parse (GstAudioDecoder * dec,
	GstAdapter * adapter, gint * offset, gint * length);
static GstFlowReturn gst_rto_aac_dec_handle_frame (GstAudioDecoder * dec,
    GstBuffer * buffer);
static void gst_rto_aac_dec_flush (GstAudioDecoder * dec, gboolean hard);
static gboolean gst_rto_aac_dec_sink_event (GstAudioDecoder * dec,
	GstEvent *event);

static gboolean gst_rto_aac_dec_init_decoder (GstRtoAacDec * me);
static gboolean gst_rto_aac_dec_cleanup_decoder (GstRtoAacDec * me);
